turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LC2B.atdf
        <register name="KEY" offset="0x20" rw="W" size="4" count="8" initval="0x00000000" caption="Key Register">
          <bitfield name="KEY0" caption="Key Word 0" mask="0xFFFFFFFF"/>
        </register>
        <register name="INITVECT" offset="0x40" rw="W" size="4" count="4" initval="0x00000000" caption="Initialization Vector Register">
          <bitfield name="INITVECT0" caption="Initialization Vector Word 0" mask="0xFFFFFFFF"/>
        </register>
        <register name="IDATA" offset="0x50" rw="W" size="4" initval="0x00000000" caption="Input Data Register">
          <bitfield name="IDATA" caption="Input Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="ODATA" offset="0x60" rw="R" size="4" initval="0x00000000" caption="Output Data Register">
          <bitfield name="ODATA" caption="Output Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="DRNGSEED" offset="0x70" rw="W" size="4" initval="0x00000000" caption="DRNG Seed Register">
          <bitfield name="SEED" caption="DRNG Seed" mask="0xFFFFFFFF"/>
        </register>
        <register name="PARAMETER" offset="0xF8" rw="R" size="4" initval="0x00000112" caption="Parameter Register">
          <bitfield name="KEYSIZE" caption="Maximum Key Size" mask="0x3"/>
          <bitfield name="OPMODE" caption="Maximum Number of Confidentiality Modes of Operation" mask="0x1C"/>
          <bitfield name="CTRMEAS" caption="Countermeasures" mask="0x100"/>
        </register>
        <register name="VERSION" offset="0xFC" rw="R" size="4" initval="0x00000102" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
      </register-group>
    </module>
    <module name="AST" id="I7532" version="3.1.1" caption="Asynchronous Timer">
      <register-group name="AST" caption="Asynchronous Timer">
        <register name="CR" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="EN" caption="Enable" mask="0x1" values="AST_CR__EN"/>
          <bitfield name="PCLR" caption="Prescaler Clear" mask="0x2"/>
          <bitfield name="CAL" caption="Calendar mode" mask="0x4"/>
          <bitfield name="CA0" caption="Clear on Alarm 0" mask="0x100"/>
          <bitfield name="CA1" caption="Clear on Alarm 1" mask="0x200"/>
          <bitfield name="PSEL" caption="Prescaler Select" mask="0x1F0000"/>
        </register>
        <register name="CV" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Counter Value">
          <bitfield name="VALUE" caption="AST Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="SR" offset="0x8" rw="R" size="4" access-size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="OVF" caption="Overflow" mask="0x1"/>
          <bitfield name="ALARM0" caption="Alarm 0" mask="0x100"/>
          <bitfield name="ALARM1" caption="Alarm 1" mask="0x200"/>
          <bitfield name="PER0" caption="Periodic 0" mask="0x10000"/>
          <bitfield name="PER1" caption="Periodic 1" mask="0x20000"/>
          <bitfield name="BUSY" caption="AST Busy" mask="0x1000000" values="AST_SR__BUSY"/>
          <bitfield name="READY" caption="AST Ready" mask="0x2000000"/>
          <bitfield name="CLKBUSY" caption="Clock Busy" mask="0x10000000" values="AST_SR__CLKBUSY"/>
          <bitfield name="CLKRDY" caption="Clock Ready" mask="0x20000000"/>
        </register>
        <register name="SCR" offset="0xC" rw="W" size="4" access-size="4" atomic-op="clear:SR" initval="0x00000000" caption="Status Clear Register">
          <bitfield name="OVF" caption="Overflow" mask="0x1"/>
          <bitfield name="ALARM0" caption="Alarm 0" mask="0x100"/>
          <bitfield name="ALARM1" caption="Alarm 1" mask="0x200"/>
          <bitfield name="PER0" caption="Periodic 0" mask="0x10000"/>
          <bitfield name="PER1" caption="Periodic 1" mask="0x20000"/>
          <bitfield name="READY" caption="AST Ready" mask="0x2000000"/>
          <bitfield name="CLKRDY" caption="Clock Ready" mask="0x20000000"/>
        </register>
        <register name="IER" offset="0x10" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="OVF" caption="Overflow" mask="0x1" values="AST_IER__OVF"/>
          <bitfield name="ALARM0" caption="Alarm 0" mask="0x100" values="AST_IER__ALARM0"/>
          <bitfield name="ALARM1" caption="Alarm 1" mask="0x200" values="AST_IER__ALARM1"/>
          <bitfield name="PER0" caption="Periodic 0" mask="0x10000" values="AST_IER__PER0"/>
          <bitfield name="PER1" caption="Periodic 1" mask="0x20000" values="AST_IER__PER1"/>
          <bitfield name="READY" caption="AST Ready" mask="0x2000000" values="AST_IER__READY"/>
          <bitfield name="CLKRDY" caption="Clock Ready" mask="0x20000000" values="AST_IER__CLKRDY"/>
        </register>
        <register name="IDR" offset="0x14" rw="W" size="4" access-size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="OVF" caption="Overflow" mask="0x1" values="AST_IDR__OVF"/>
          <bitfield name="ALARM0" caption="Alarm 0" mask="0x100" values="AST_IDR__ALARM0"/>
          <bitfield name="ALARM1" caption="Alarm 1" mask="0x200" values="AST_IDR__ALARM1"/>
          <bitfield name="PER0" caption="Periodic 0" mask="0x10000" values="AST_IDR__PER0"/>
          <bitfield name="PER1" caption="Periodic 1" mask="0x20000" values="AST_IDR__PER1"/>
          <bitfield name="READY" caption="AST Ready" mask="0x2000000" values="AST_IDR__READY"/>
          <bitfield name="CLKRDY" caption="Clock Ready" mask="0x20000000" values="AST_IDR__CLKRDY"/>
        </register>
        <register name="IMR" offset="0x18" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="OVF" caption="Overflow" mask="0x1" values="AST_IMR__OVF"/>
          <bitfield name="ALARM0" caption="Alarm 0" mask="0x100" values="AST_IMR__ALARM0"/>
          <bitfield name="ALARM1" caption="Alarm 1" mask="0x200" values="AST_IMR__ALARM1"/>
          <bitfield name="PER0" caption="Periodic 0" mask="0x10000" values="AST_IMR__PER0"/>
          <bitfield name="PER1" caption="Periodic 1" mask="0x20000" values="AST_IMR__PER1"/>
          <bitfield name="READY" caption="AST Ready" mask="0x2000000" values="AST_IMR__READY"/>
          <bitfield name="CLKRDY" caption="Clock Ready" mask="0x20000000" values="AST_IMR__CLKRDY"/>
        </register>
        <register name="WER" offset="0x1C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Wake Enable Register">
          <bitfield name="OVF" caption="Overflow" mask="0x1" values="AST_WER__OVF"/>
          <bitfield name="ALARM0" caption="Alarm 0" mask="0x100" values="AST_WER__ALARM0"/>
          <bitfield name="ALARM1" caption="Alarm 1" mask="0x200" values="AST_WER__ALARM1"/>
          <bitfield name="PER0" caption="Periodic 0" mask="0x10000" values="AST_WER__PER0"/>
          <bitfield name="PER1" caption="Periodic 1" mask="0x20000" values="AST_WER__PER1"/>
        </register>
