turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LC2B.atdf
        <register name="AR0" offset="0x20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Alarm Register 0">
          <bitfield name="VALUE" caption="Alarm Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="AR1" offset="0x24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Alarm Register 1">
          <bitfield name="VALUE" caption="Alarm Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="PIR0" offset="0x30" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Periodic Interval Register 0">
          <bitfield name="INSEL" caption="Interval Select" mask="0x1F"/>
        </register>
        <register name="PIR1" offset="0x34" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Periodic Interval Register 1">
          <bitfield name="INSEL" caption="Interval Select" mask="0x1F"/>
        </register>
        <register name="CLOCK" offset="0x40" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Clock Control Register">
          <bitfield name="CEN" caption="Clock Enable" mask="0x1" values="AST_CLOCK__CEN"/>
          <bitfield name="CSSEL" caption="Clock Source Selection" mask="0x700" values="AST_CLOCK__CSSEL"/>
        </register>
        <register name="DTR" offset="0x44" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Digital Tuner Register">
          <bitfield name="EXP" caption="EXP" mask="0x1F"/>
          <bitfield name="ADD" caption="ADD" mask="0x20"/>
          <bitfield name="VALUE" caption="VALUE" mask="0xFF00"/>
        </register>
        <register name="EVE" offset="0x48" rw="W" size="4" access-size="4" atomic-op="set:EVM" initval="0x00000000" caption="Event Enable Register">
          <bitfield name="OVF" caption="Overflow" mask="0x1"/>
          <bitfield name="ALARM0" caption="Alarm 0" mask="0x100"/>
          <bitfield name="ALARM1" caption="Alarm 1" mask="0x200"/>
          <bitfield name="PER0" caption="Perioidc 0" mask="0x10000"/>
          <bitfield name="PER1" caption="Periodic 1" mask="0x20000"/>
        </register>
        <register name="EVD" offset="0x4C" rw="W" size="4" access-size="4" atomic-op="clear:EVM" initval="0x00000000" caption="Event Disable Register">
          <bitfield name="OVF" caption="Overflow" mask="0x1"/>
          <bitfield name="ALARM0" caption="Alarm 0" mask="0x100"/>
          <bitfield name="ALARM1" caption="Alarm 1" mask="0x200"/>
          <bitfield name="PER0" caption="Perioidc 0" mask="0x10000"/>
          <bitfield name="PER1" caption="Periodic 1" mask="0x20000"/>
        </register>
        <register name="EVM" offset="0x50" rw="R" size="4" access-size="4" initval="0x00000000" caption="Event Mask Register">
          <bitfield name="OVF" caption="Overflow" mask="0x1"/>
          <bitfield name="ALARM0" caption="Alarm 0" mask="0x100"/>
          <bitfield name="ALARM1" caption="Alarm 1" mask="0x200"/>
          <bitfield name="PER0" caption="Perioidc 0" mask="0x10000"/>
          <bitfield name="PER1" caption="Periodic 1" mask="0x20000"/>
        </register>
        <register name="CALV" offset="0x54" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Calendar Value">
          <bitfield name="SEC" caption="Second" mask="0x3F"/>
          <bitfield name="MIN" caption="Minute" mask="0xFC0"/>
          <bitfield name="HOUR" caption="Hour" mask="0x1F000"/>
          <bitfield name="DAY" caption="Day" mask="0x3E0000"/>
          <bitfield name="MONTH" caption="Month" mask="0x3C00000"/>
          <bitfield name="YEAR" caption="Year" mask="0xFC000000"/>
        </register>
        <register name="PARAMETER" offset="0xF0" rw="R" size="4" access-size="4" caption="Parameter Register">
          <bitfield name="DT" caption="Digital Tuner" mask="0x1" values="AST_PARAMETER__DT"/>
          <bitfield name="DTEXPWA" caption="Digital Tuner Exponent Writeable" mask="0x2" values="AST_PARAMETER__DTEXPWA"/>
          <bitfield name="DTEXPVALUE" caption="Digital Tuner Exponent Value" mask="0x7C"/>
          <bitfield name="NUMAR" caption="Number of alarm comparators" mask="0x300" values="AST_PARAMETER__NUMAR"/>
          <bitfield name="NUMPIR" caption="Number of periodic comparators" mask="0x1000" values="AST_PARAMETER__NUMPIR"/>
          <bitfield name="PIR0WA" caption="Periodic Interval 0 Writeable" mask="0x4000" values="AST_PARAMETER__PIR0WA"/>
          <bitfield name="PIR1WA" caption="Periodic Interval 1 Writeable" mask="0x8000" values="AST_PARAMETER__PIR1WA"/>
          <bitfield name="PER0VALUE" caption="Periodic Interval 0 Value" mask="0x1F0000"/>
          <bitfield name="PER1VALUE" caption="Periodic Interval 1 Value" mask="0x1F000000"/>
        </register>
        <register name="VERSION" offset="0xFC" rw="R" size="4" access-size="4" initval="0x00000311" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
      </register-group>
      <value-group name="AST_CR__EN">
        <value name="0" caption="The AST is disabled." value="0"/>
        <value name="1" caption="The AST is enabled" value="1"/>
      </value-group>
      <value-group name="AST_SR__BUSY">
        <value name="0" caption="The AST accepts writes to CV, WER, DTR, SCR, AR, PIR and CR" value="0"/>
        <value name="1" caption="The AST is busy and will discard writes to CV, WER, DTR, SCR, AR, PIR and CR" value="1"/>
      </value-group>
      <value-group name="AST_SR__CLKBUSY">
        <value name="0" caption="The clock is ready and can be changed" value="0"/>
        <value name="1" caption="CEN has been written and the clock is busy" value="1"/>
      </value-group>
      <value-group name="AST_IER__ALARM0">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Enable interrupt" value="1"/>
      </value-group>
      <value-group name="AST_IER__ALARM1">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Enable interrupt" value="1"/>
      </value-group>
      <value-group name="AST_IER__CLKRDY">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Enable interrupt" value="1"/>
      </value-group>
      <value-group name="AST_IER__OVF">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Enable Interrupt." value="1"/>
      </value-group>
