turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LC2B.atdf
        <register name="ICR" offset="0x10" rw="W" size="4" access-size="4" atomic-op="clear:ISR" initval="0x00000000" caption="Interrupt Clear Register">
          <bitfield name="PSOK" caption="Power Scaling OK Interrupt Status Clear" mask="0x1"/>
          <bitfield name="AE" caption="Access Error Interrupt Status Clear" mask="0x80000000"/>
        </register>
        <register name="SR" offset="0x14" rw="R" size="4" access-size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="PSOK" caption="Power Scaling OK Status" mask="0x1"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="UNLOCK" offset="0x18" rw="W" size="4" access-size="4" initval="0x00000000" caption="Unlock Register">
          <bitfield name="ADDR" caption="Unlock Address" mask="0x3FF"/>
          <bitfield name="KEY" caption="Unlock Key" mask="0xFF000000"/>
        </register>
        <register name="PMCON" offset="0x1C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Power Mode Control Register">
          <bitfield name="PS" caption="Power Scaling Configuration Value" mask="0x3"/>
          <bitfield name="PSCREQ" caption="Power Scaling Change Request" mask="0x4"/>
          <bitfield name="PSCM" caption="Power Scaling Change Mode" mask="0x8"/>
          <bitfield name="BKUP" caption="BACKUP Mode" mask="0x100"/>
          <bitfield name="RET" caption="RETENTION Mode" mask="0x200"/>
          <bitfield name="SLEEP" caption="SLEEP mode Configuration" mask="0x3000"/>
          <bitfield name="CK32S" caption="32Khz-1Khz Clock Source Selection" mask="0x10000"/>
          <bitfield name="FASTWKUP" caption="Fast Wakeup" mask="0x1000000"/>
        </register>
        <register name="BKUPWCAUSE" offset="0x28" rw="R" size="4" access-size="4" initval="0x00000000" caption="Backup Wake up Cause Register">
        </register>
        <register name="BKUPWEN" offset="0x2C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Backup Wake up Enable Register">
        </register>
        <register name="BKUPPMUX" offset="0x30" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Backup Pin Muxing Register">
          <bitfield name="BKUPPMUX" caption="Backup Pin Muxing" mask="0x1FF"/>
        </register>
        <register name="IORET" offset="0x34" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Input Output Retention Register">
          <bitfield name="RET" caption="Retention on I/O lines after waking up from the BACKUP mode" mask="0x1"/>
        </register>
        <register name="BPR" offset="0x40" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bypass Register">
          <bitfield name="RUNPSPB" caption="Run Mode Power Scaling Preset Bypass" mask="0x1"/>
          <bitfield name="PSMPSPB" caption="Power Save Mode Power Scaling Preset Bypass" mask="0x2"/>
          <bitfield name="SEQSTN" caption="Sequencial Startup from ULP (Active Low)" mask="0x4"/>
          <bitfield name="PSBTD" caption="Power Scaling Bias Timing Disable" mask="0x8"/>
          <bitfield name="PSHFD" caption="Power Scaling Halt Flash Until VREGOK Disable" mask="0x10"/>
          <bitfield name="DLYRSTD" caption="Delaying Reset Disable" mask="0x20"/>
          <bitfield name="BIASSEN" caption="Bias Switch Enable" mask="0x40"/>
          <bitfield name="LATSEN" caption="Latdel Switch Enable" mask="0x80"/>
          <bitfield name="BOD18CONT" caption="BOD18 in continuous mode not disabled in WAIT/RET/BACKUP modes" mask="0x100"/>
          <bitfield name="POBS" caption="Pico Uart Observability" mask="0x200"/>
          <bitfield name="FFFW" caption="Force Flash Fast Wakeup" mask="0x400"/>
          <bitfield name="FBRDYEN" caption="Flash Bias Ready Enable" mask="0x800"/>
          <bitfield name="FVREFSEN" caption="Flash Vref Switch Enable" mask="0x1000"/>
        </register>
        <register name="FWRUNPS" offset="0x44" rw="R" size="4" access-size="4" caption="Factory Word Run PS Register">
          <bitfield name="REGLEVEL" caption="Regulator Voltage Level" mask="0xF"/>
          <bitfield name="REGTYPE" caption="Regulator Type" mask="0x30" values="BPM_FWRUNPS__REGTYPE"/>
          <bitfield name="REFTYPE" caption="Reference Type" mask="0xC0" values="BPM_FWRUNPS__REFTYPE"/>
          <bitfield name="FLASHLATDEL" caption="Flash Latch Delay Value" mask="0x1F00"/>
          <bitfield name="FLASHBIAS" caption="Flash Bias Value" mask="0x1E000"/>
          <bitfield name="FPPW" caption="Flash Pico Power Mode" mask="0x20000"/>
          <bitfield name="RC115" caption="RC 115KHZ Calibration Value" mask="0x1FC0000"/>
          <bitfield name="RCFAST" caption="RCFAST Calibration Value" mask="0xFE000000"/>
        </register>
        <register name="FWPSAVEPS" offset="0x48" rw="R" size="4" access-size="4" caption="Factory Word Power Save PS Register">
          <bitfield name="WREGLEVEL" caption="Wait mode Regulator Level" mask="0xF"/>
          <bitfield name="WBIAS" caption="Bias in wait mode" mask="0xF0"/>
          <bitfield name="WLATDEL" caption="Flash Latdel in wait mode" mask="0x1F00"/>
          <bitfield name="RREGLEVEL" caption="Retention mode Regulator Level" mask="0x1E000"/>
          <bitfield name="RBIAS" caption="Bias in Retention mode" mask="0x1E0000"/>
          <bitfield name="RLATDEL" caption="Flash Latdel in Retention mode" mask="0x3E00000"/>
          <bitfield name="BREGLEVEL" caption="Backup mode Regulator Level" mask="0x3C000000"/>
          <bitfield name="POR18DIS" caption="POR 18 Disable" mask="0x40000000"/>
          <bitfield name="FWSAS" caption="Flash Wait State Automatic Switching" mask="0x80000000"/>
        </register>
        <register name="VERSION" offset="0xFC" rw="R" size="4" access-size="4" initval="0x00000120" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
      </register-group>
      <value-group name="BPM_FWRUNPS__REFTYPE">
        <value name="BOTH" value="0"/>
        <value name="BG" value="1"/>
        <value name="LPBG" value="2"/>
        <value name="INTERNAL" value="3"/>
      </value-group>
      <value-group name="BPM_FWRUNPS__REGTYPE">
        <value name="NORMAL" value="0"/>
        <value name="LP" value="1"/>
        <value name="XULP" value="2"/>
      </value-group>
    </module>
    <module name="BSCIF" version="1.0.0" caption="Backup System Control Interface">
      <register-group name="BSCIF" caption="Backup System Control Interface">
        <register name="IER" offset="0x0" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="OSC32RDY" caption="32kHz Oscillator Ready" mask="0x1"/>
          <bitfield name="RC32KRDY" caption="32kHz RC Oscillator Ready" mask="0x2"/>
          <bitfield name="RC32KLOCK" caption="32kHz RC Oscillator Lock" mask="0x4"/>
          <bitfield name="RC32KREFE" caption="32kHz RC Oscillator Reference Error" mask="0x8"/>
          <bitfield name="RC32KSAT" caption="32kHz RC Oscillator Saturation" mask="0x10"/>
          <bitfield name="BOD33DET" caption="BOD33 Detected" mask="0x20"/>
          <bitfield name="BOD18DET" caption="BOD18 Detected" mask="0x40"/>
          <bitfield name="BOD33SYNRDY" caption="BOD33 Synchronization Ready" mask="0x80"/>
          <bitfield name="BOD18SYNRDY" caption="BOD18 Synchronization Ready" mask="0x100"/>
          <bitfield name="SSWRDY" caption="VREG Stop Switching Ready" mask="0x200"/>
          <bitfield name="VREGOK" caption="Main VREG OK" mask="0x400"/>
          <bitfield name="LPBGRDY" caption="Low Power Bandgap Voltage Reference Ready" mask="0x1000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="IDR" offset="0x4" rw="W" size="4" access-size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="OSC32RDY" caption="32kHz Oscillator Ready" mask="0x1"/>
          <bitfield name="RC32KRDY" caption="32kHz RC Oscillator Ready" mask="0x2"/>
          <bitfield name="RC32KLOCK" caption="32kHz RC Oscillator Lock" mask="0x4"/>
          <bitfield name="RC32KREFE" caption="32kHz RC Oscillator Reference Error" mask="0x8"/>
          <bitfield name="RC32KSAT" caption="32kHz RC Oscillator Saturation" mask="0x10"/>
          <bitfield name="BOD33DET" caption="BOD33 Detected" mask="0x20"/>
          <bitfield name="BOD18DET" caption="BOD18 Detected" mask="0x40"/>
          <bitfield name="BOD33SYNRDY" caption="BOD33 Synchronization Ready" mask="0x80"/>
          <bitfield name="BOD18SYNRDY" caption="BOD18 Synchronization Ready" mask="0x100"/>
          <bitfield name="SSWRDY" caption="VREG Stop Switching Ready" mask="0x200"/>
          <bitfield name="VREGOK" caption="Mai n VREG OK" mask="0x400"/>
          <bitfield name="LPBGRDY" caption="Low Power Bandgap Voltage Reference Ready" mask="0x1000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="IMR" offset="0x8" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="OSC32RDY" caption="32kHz Oscillator Ready" mask="0x1"/>
          <bitfield name="RC32KRDY" caption="32kHz RC Oscillator Ready" mask="0x2"/>
          <bitfield name="RC32KLOCK" caption="32kHz RC Oscillator Lock" mask="0x4"/>
          <bitfield name="RC32KREFE" caption="32kHz RC Oscillator Reference Error" mask="0x8"/>
          <bitfield name="RC32KSAT" caption="32kHz RC Oscillator Saturation" mask="0x10"/>
          <bitfield name="BOD33DET" caption="BOD33 Detected" mask="0x20"/>
          <bitfield name="BOD18DET" caption="BOD18 Detected" mask="0x40"/>
          <bitfield name="BOD33SYNRDY" caption="BOD33 Synchronization Ready" mask="0x80"/>
          <bitfield name="BOD18SYNRDY" caption="BOD18 Synchronization Ready" mask="0x100"/>
          <bitfield name="SSWRDY" caption="VREG Stop Switching Ready" mask="0x200"/>
          <bitfield name="VREGOK" caption="Main VREG OK" mask="0x400"/>
          <bitfield name="LPBGRDY" caption="Low Power Bandgap Voltage Reference Ready" mask="0x1000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="ISR" offset="0xC" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="OSC32RDY" caption="32kHz Oscillator Ready" mask="0x1"/>
          <bitfield name="RC32KRDY" caption="32kHz RC Oscillator Ready" mask="0x2"/>
          <bitfield name="RC32KLOCK" caption="32kHz RC Oscillator Lock" mask="0x4"/>
          <bitfield name="RC32KREFE" caption="32kHz RC Oscillator Reference Error" mask="0x8"/>
          <bitfield name="RC32KSAT" caption="32kHz RC Oscillator Saturation" mask="0x10"/>
          <bitfield name="BOD33DET" caption="BOD33 Detected" mask="0x20"/>
          <bitfield name="BOD18DET" caption="BOD18 Detected" mask="0x40"/>
          <bitfield name="BOD33SYNRDY" caption="BOD33 Synchronization Ready" mask="0x80"/>
          <bitfield name="BOD18SYNRDY" caption="BOD18 Synchronization Ready" mask="0x100"/>
          <bitfield name="SSWRDY" caption="VREG Stop Switching Ready" mask="0x200"/>
          <bitfield name="VREGOK" caption="Main VREG OK" mask="0x400"/>
          <bitfield name="LPBGRDY" caption="Low Power Bandgap Voltage Reference Ready" mask="0x1000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
