turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LC2B.atdf
      <value-group name="TC_CMR__BURST">
        <value name="NOT_GATED" caption="The clock is not gated by an external signal." value="0"/>
        <value name="CLK_AND_XC0" caption="XC0 is ANDed with the selected clock." value="1"/>
        <value name="CLK_AND_XC1" caption="XC1 is ANDed with the selected clock." value="2"/>
        <value name="CLK_AND_XC2" caption="XC2 is ANDed with the selected clock." value="3"/>
      </value-group>
      <value-group name="TC_CMR__CLKI">
        <value name="0" caption="Counter is incremented on rising edge of the clock." value="0"/>
        <value name="1" caption="Counter is incremented on falling edge of the clock." value="1"/>
      </value-group>
      <value-group name="TC_CMR__CPCTRG">
        <value name="0" caption="RC Compare has no effect on the counter and its clock." value="0"/>
        <value name="1" caption="RC Compare resets the counter and starts the counter clock." value="1"/>
      </value-group>
      <value-group name="TC_CMR__ETRGEDG">
        <value name="NO_EDGE" caption="None" value="0"/>
        <value name="POS_EDGE" caption="Rising edge" value="1"/>
        <value name="NEG_EDGE" caption="Falling edge" value="2"/>
        <value name="BOTH_EDGES" caption="Each edge" value="3"/>
      </value-group>
      <value-group name="TC_CMR__LDBDIS">
        <value name="0" caption="Counter clock is not disabled when RB loading occurs." value="0"/>
        <value name="1" caption="Counter clock is disabled when RB loading occurs." value="1"/>
      </value-group>
      <value-group name="TC_CMR__LDBSTOP">
        <value name="0" caption="Counter clock is not stopped when RB loading occurs." value="0"/>
        <value name="1" caption="Counter clock is stopped when RB loading occurs." value="1"/>
      </value-group>
      <value-group name="TC_CMR__LDRA">
        <value name="NO_EDGE" caption="None" value="0"/>
        <value name="POS_EDGE_TIOA" caption="Rising edge of TIOA" value="1"/>
        <value name="NEG_EDGE_TIOA" caption="Falling edge of TIOA" value="2"/>
        <value name="BOTH_EDGES_TIOA" caption="Each edge of TIOA" value="3"/>
      </value-group>
      <value-group name="TC_CMR__LDRB">
        <value name="NO_EDGE" caption="None" value="0"/>
        <value name="POS_EDGE_TIOA" caption="Rising edge of TIOA" value="1"/>
        <value name="NEG_EDGE_TIOA" caption="Falling edge of TIOA" value="2"/>
        <value name="BOTH_EDGES_TIOA" caption="Each edge of TIOA" value="3"/>
      </value-group>
      <value-group name="TC_CMR__TCCLKS">
        <value name="TIMER_CLOCK1" caption="TIMER_CLOCK1" value="0"/>
        <value name="TIMER_CLOCK2" caption="TIMER_CLOCK2" value="1"/>
        <value name="TIMER_CLOCK3" caption="TIMER_CLOCK3" value="2"/>
        <value name="TIMER_CLOCK4" caption="TIMER_CLOCK4" value="3"/>
        <value name="TIMER_CLOCK5" caption="TIMER_CLOCK5" value="4"/>
        <value name="XC0" caption="XC0" value="5"/>
        <value name="XC1" caption="XC1" value="6"/>
        <value name="XC2" caption="XC2" value="7"/>
      </value-group>
      <value-group name="TC_CMR__WAVE">
        <value name="0" caption="Capture Mode is enabled." value="0"/>
        <value name="1" caption="Capture Mode is disabled (Waveform Mode is enabled)." value="1"/>
      </value-group>
      <value-group name="TC_CMR__ACPA">
        <value name="NONE" caption="None" value="0"/>
        <value name="SET" caption="Set" value="1"/>
        <value name="CLEAR" caption="Clear" value="2"/>
        <value name="TOGGLE" caption="Toggle" value="3"/>
      </value-group>
      <value-group name="TC_CMR__ACPC">
        <value name="NONE" caption="None" value="0"/>
        <value name="SET" caption="Set" value="1"/>
        <value name="CLEAR" caption="Clear" value="2"/>
        <value name="TOGGLE" caption="Toggle" value="3"/>
      </value-group>
      <value-group name="TC_CMR__AEEVT">
        <value name="NONE" caption="None" value="0"/>
        <value name="SET" caption="Set" value="1"/>
        <value name="CLEAR" caption="Clear" value="2"/>
        <value name="TOGGLE" caption="Toggle" value="3"/>
      </value-group>
      <value-group name="TC_CMR__ASWTRG">
        <value name="NONE" caption="None" value="0"/>
        <value name="SET" caption="Set" value="1"/>
        <value name="CLEAR" caption="Clear" value="2"/>
        <value name="TOGGLE" caption="Toggle" value="3"/>
      </value-group>
      <value-group name="TC_CMR__BCPB">
        <value name="NONE" caption="None" value="0"/>
        <value name="SET" caption="Set" value="1"/>
        <value name="CLEAR" caption="Clear" value="2"/>
        <value name="TOGGLE" caption="Toggle" value="3"/>
      </value-group>
      <value-group name="TC_CMR__BCPC">
        <value name="NONE" caption="None" value="0"/>
        <value name="SET" caption="Set" value="1"/>
        <value name="CLEAR" caption="Clear" value="2"/>
        <value name="TOGGLE" caption="Toggle" value="3"/>
      </value-group>
      <value-group name="TC_CMR__BEEVT">
        <value name="NONE" caption="None" value="0"/>
        <value name="SET" caption="Set" value="1"/>
        <value name="CLEAR" caption="Clear" value="2"/>
        <value name="TOGGLE" caption="Toggle" value="3"/>
      </value-group>
      <value-group name="TC_CMR__BSWTRG">
        <value name="NONE" caption="None" value="0"/>
        <value name="SET" caption="Set" value="1"/>
        <value name="CLEAR" caption="Clear" value="2"/>
        <value name="TOGGLE" caption="Toggle" value="3"/>
      </value-group>
      <value-group name="TC_CMR__CPCDIS">
        <value name="0" caption="Counter clock is not disabled when counter reaches RC." value="0"/>
        <value name="1" caption="Counter clock is disabled when counter reaches RC." value="1"/>
      </value-group>
      <value-group name="TC_CMR__CPCSTOP">
        <value name="0" caption="Counter clock is not stopped when counter reaches RC." value="0"/>
        <value name="1" caption="Counter clock is stopped when counter reaches RC." value="1"/>
      </value-group>
      <value-group name="TC_CMR__EEVT">
        <value name="TIOB_INPUT" caption="TIOB input. If TIOB is chosen as the external event signal, it is configured as an input and no longer generates waveforms." value="0"/>
        <value name="XC0_OUTPUT" caption="XC0 output" value="1"/>
        <value name="XC1_OUTPUT" caption="XC1 output" value="2"/>
        <value name="XC2_OUTPUT" caption="XC2 output" value="3"/>
      </value-group>
      <value-group name="TC_CMR__EEVTEDG">
        <value name="NO_EDGE" caption="None" value="0"/>
        <value name="POS_EDGE" caption="Rising edge" value="1"/>
        <value name="NEG_EDGE" caption="Falling edge" value="2"/>
        <value name="BOTH_EDGES" caption="Each edge" value="3"/>
      </value-group>
      <value-group name="TC_CMR__ENETRG">
        <value name="0" caption="The external event has no effect on the counter and its clock. In this case, the selected external event only controls the TIOA output." value="0"/>
        <value name="1" caption="The external event resets the counter and starts the counter clock." value="1"/>
      </value-group>
